Public Attributes | List of all members
API_RVMLayoutInfo Struct Reference
Revision Management
Represents layout meta data in API_RVMDocumentRevision. More...
#include <APIdefs_Database.h>
 Public Attributes
GS::UniString  | id
ID of the layout.
API_DatabaseUnId  | dbId
Database unique identifier. Valid only for opened issue.
GS::UniString  | name
Name of the layout.
GS::UniString  | masterLayoutName
Name of the master layout.
double  | width
Width of the layout.
double  | height
Height of the layout.
GS::Array< GS::UniString >  | drawingScales
Array of the drawing scales.
GS::UniString  | subsetId
ID of the subset.
GS::UniString  | subsetName
Name of the subset.
GS::HashTable< API_Guid, GS::UniString >  | customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
short  | teamworkOwner
Teamwork owner of the layout.
short  | filler [3]
Detailed Description
Represents layout meta data in API_RVMDocumentRevision.
Remarks
This structure contains layout meta data for API_RVMDocumentRevision.
Member Data Documentation
◆ customData
 API_RVMLayoutInfo::customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
◆ dbId
 API_RVMLayoutInfo::dbId
Database unique identifier. Valid only for opened issue.
◆ drawingScales
 API_RVMLayoutInfo::drawingScales
Array of the drawing scales.
◆ filler
 short API_RVMLayoutInfo::filler[3]
◆ height
 API_RVMLayoutInfo::height
Height of the layout.
◆ id
 API_RVMLayoutInfo::id
ID of the layout.
◆ masterLayoutName
 API_RVMLayoutInfo::masterLayoutName
Name of the master layout.
◆ name
 API_RVMLayoutInfo::name
Name of the layout.
◆ subsetId
 API_RVMLayoutInfo::subsetId
ID of the subset.
◆ subsetName
 API_RVMLayoutInfo::subsetName
Name of the subset.
◆ teamworkOwner
 API_RVMLayoutInfo::teamworkOwner
Teamwork owner of the layout.
◆ width
 API_RVMLayoutInfo::width
Width of the layout.